EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыПолигоновМаршрутизации/ДополнительныеПараметрыПолигоновМаршрутизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыПолигоновМаршрутизации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПолигонСоСложнойПарковкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерПолигона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыПолигоновМаршрутизации/ManagerModule.bsl
Функция  СписокПолигоновСоСложнойПарковкой() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеПараметрыПолигоновМаршрутизацииСрезПоследних.НомерПолигона КАК НомерПолигона
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыПолигоновМаршрутизации.СрезПоследних КАК ДополнительныеПараметрыПолигоновМаршрутизацииСрезПоследних
		|ГДЕ
		|	ДополнительныеПараметрыПолигоновМаршрутизацииСрезПоследних.ПолигонСоСложнойПарковкой
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеПараметрыПолигоновМаршрутизацииСрезПоследних.НомерПолигона";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерПолигона");
	
КонецФункции
